# frozen_string_literal: true

module Chat
  module Command
    class ManGames
      prepend BasicService

      param :command
      param :message_type

      attr_reader :message

      def call
        message = ['<b>Поиск информации о нескольких (до десяти) играх</b>']
        message << 'Сначала идет поиск игр, наименование которой начинается с введеной ' \
                   'игроком информации'
        message << 'Например, запрос <code>/games the wit</code> ' \
                   'найдет игры <code>The Witcher 3: Wild Hunt</code> и <code>The Witness</code>'
        message << 'Далее поиск продолжается по играм, в названии которых ' \
                   'содержатся слова или части слов, введенные игроком в любом порядке. Эти ' \
                   'игры добавляются в конец полученных результатов'
        message << 'Например, запрос <code>/games devil</code> найдет сначала ' \
                   '<code>Devil May Cry 5</code> а затем такие игры, как ' \
                   '<code>Doodle Devil</code>. При этом в результате поиска ' \
                   '<code>Doodle Devil</code> будет идти после <code>Devil May Cry 5</code>'
        message << 'Результат поиска выводится в виде нумернованного списка следующим образом: ' \
                   '<b>%НОМЕР НАЙДЕННОЙ ИГРЫ%</b> <b>%НАЗВАНИЕ НАЙДЕННОЙ ИГРЫ%</b>'
        message << 'При нажатии на номер найденной игры будет выведена информация о ' \
                   'выбранной игре'
        message << 'Если игр не найдено, то выводится сообщение <code>Игорь нет</code>'
        message << 'Результаты поиска сохраняются в течении пяти минут, и если игрок за это ' \
                   'время не выбрал игру, то ему придется вводить команду ' \
                   '<code>/games</code> заново'
        message << 'Стоит помнить, что HolyRider запоминает игрока, отправившего команду ' \
                   '<code>/games</code>, поэтому получить информацию об игре из списка может ' \
                   'только игрок, отправивший команду.'
        message << 'То есть, если другой игрок захочет найти несколько игр, то ему надо ввести ' \
                   'команду <code>/games</code> самому'
        message << 'Списки найденных игр не зависят друг от друга и не перетирают ' \
                   'информацию друг о друге'

        @message = [message.join("\n")]
      end
    end
  end
end
